bases/WIM_FIn/projects/IMDEV-8662 Оптимизация запросов по проведению Перерегистрации (сделки)/Расширения/FonProv/DataProcessors/FonProv_ПерепроведениеСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>FonProv_ПерепроведениеСделок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пул</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пул</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-8662 Оптимизация запросов по проведению Перерегистрации (сделки)/Расширения/FonProv/DataProcessors/FonProv_ПерепроведениеСделок/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		Объект.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Объект.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;

	НачалоПериода = Объект.НачалоПериода;
	КонецПериода = Объект.КонецПериода;
	Портфель = Объект.Портфель;
	Пул = Объект.Пул;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепровести(Команда)

	Если Не ПараметрыПерепроведенияКорректны() Тогда
		Возврат;
	КонецЕсли;

	Состояние(НСтр("ru = 'Запуск перепроведения сделок в фоновом задании...'"));

	РезультатВыполнения = ЗапуститьПерепроведениеВФонеНаСервере();

	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перепроведение сделок завершено.'"));
		Возврат;
	КонецЕсли;

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПерепровестиЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыПерепроведенияКорректны()

	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите начало периода.'"));
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите конец периода.'"));
		Возврат Ложь;
	КонецЕсли;

	Если НачалоПериода > КонецПериода Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Начало периода не может быть больше конца периода.'"));
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ПерепровестиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перепроведение сделок завершено.'"));
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ТекстОшибки = Результат.КраткоеПредставлениеОшибки;
		Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
			ТекстОшибки = Результат.ПодробноеПредставлениеОшибки;
		КонецЕсли;
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗапуститьПерепроведениеВФонеНаСервере()

	Объект.НачалоПериода = НачалоПериода;
	Объект.КонецПериода = КонецПериода;
	Объект.Портфель = Портфель;
	Объект.Пул = Пул;

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыПроцедуры.Вставить("КонецПериода", КонецПериода);
	ПараметрыПроцедуры.Вставить("Портфель", Портфель);
	ПараметрыПроцедуры.Вставить("Пул", Пул);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'IMDEV-8662: перепроведение сделок (FonProv)'");

	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"FonProv_ПерепроведениеСделок.ПерепровестиСделки",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);

КонецФункции

#КонецОбласти
